# LESSON TWO - PANDA

##dATAFRAME IS AMAIN OBJECT IN pANDAS. It is used to represent data with rows and columns (tabular or excel spreadsheet like data)

## 2.1 import excel data frame  & read

# 2.1.0 import pandas as pd
# 2.1.1 (dir(pd))
# 2.1.2 read excel/ csv : df6 =pd.read_csv (r'C:\Users\Sachin\Desktop\kaveri.csv',encoding='cp1252')
# 2.1.3  df.shape
# 2.1.4 rows, columns = df.shape 
# 2.1.5 df.head(2),  df.tail(2)
# 2.1.6 df[2:5], df.columns,  
# 2.1.7 df['DAY'], df[['event','DAY','temperature']]
# 2.1.8 df.describe()
# 2.1.9 df['temperature'].max() , df['temperature'].min() , df['temperature'].mean() , df[df.temperature>=30] ,
# 2.1.10 df[df.temperature == df.temperature.max()] , df[['DAY','temperature']][df.temperature == df['temperature'].min()] , 

# 2.1.11 df.index
# 2.1.12 df.set_index('DAY')           #remove index
# 2.1.13 dfl.to_excel("newtemp.xlsx", startrow=1, startcol=2, index =False)
# 2.1.14


# 2.2.1 data frames advance
# 2.2.2 convert_event_cell
# 2.2.3 place columns
# 2.2.4 concate data frame
# 2.2.5 ignore_index =True
# 2.2.6 keys = ["india","usa"]
# 2.2.7 axis =1, sort=False
# 2.2.8 Series

# 2.3.0  merge dataframe
# 2.3.1 df_merge = pd.merge(temperature_df,humidity_df, on = "city")
# 2.3.2 indicator =True
# 2.3.3 suffixes=('left','right')
# 2.3.4 np.where(new_df['temperature']> 27,'low', 0 )
# 2.3.5

In [1]:
import pandas as pd
import numpy as np

In [2]:
(dir(pd))

['Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NaT',
 'Panel',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseArray',
 'SparseDataFrame',
 'SparseDtype',
 'SparseSeries',
 'TimeGrouper',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_hashtable',
 '_lib',
 '_libs',
 '_np_version_under1p13',
 '_np_version_under1p14',
 '_np_version_under1p15',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_tslib',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'datetime',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'np',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_msgpack',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [3]:
df=pd.read_excel (r'TEMPERATURE.xls')

In [4]:
df

         DAY  temperature  windspeed  event
0 2019-01-11           32          6   RAIN
1 2019-01-12           24          7  SUNNY
2 2019-01-13           28          2   SNOW
3 2019-01-14           24          7   SNOW
4 2019-01-15           32          4   RAIN
5 2019-01-16           32          2  SUNNY

#2.1.1 shape of table

In [5]:
df.shape      #(rows,columns)

(6, 4)

In [6]:
rows, columns = df.shape

In [7]:
rows

6

In [8]:
columns

4

In [9]:
df.head(2)    #gives print only 2 rows

         DAY  temperature  windspeed  event
0 2019-01-11           32          6   RAIN
1 2019-01-12           24          7  SUNNY

In [10]:
df.tail(2)  #last 2 rows

         DAY  temperature  windspeed  event
4 2019-01-15           32          4   RAIN
5 2019-01-16           32          2  SUNNY

In [11]:
df[2:5]   #shows from 2 to 5-1=4

         DAY  temperature  windspeed event
2 2019-01-13           28          2  SNOW
3 2019-01-14           24          7  SNOW
4 2019-01-15           32          4  RAIN

In [12]:
df.columns

Index(['DAY', 'temperature', 'windspeed', 'event'], dtype='object')

In [13]:
df['DAY']

0   2019-01-11
1   2019-01-12
2   2019-01-13
3   2019-01-14
4   2019-01-15
5   2019-01-16
Name: DAY, dtype: datetime64[ns]

In [14]:
type(df['event'])

pandas.core.series.Series

In [15]:
df[['event','DAY','temperature']]

   event        DAY  temperature
0   RAIN 2019-01-11           32
1  SUNNY 2019-01-12           24
2   SNOW 2019-01-13           28
3   SNOW 2019-01-14           24
4   RAIN 2019-01-15           32
5  SUNNY 2019-01-16           32

In [16]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     28.666667   4.666667
std       3.932768   2.338090
min      24.000000   2.000000
25%      25.000000   2.500000
50%      30.000000   5.000000
75%      32.000000   6.750000
max      32.000000   7.000000

In [17]:
df['temperature'].max()

32

In [18]:
df['temperature'].min()

24

In [19]:
df['temperature'].mean()

28.666666666666668

In [20]:
df[df.temperature>=30]

         DAY  temperature  windspeed  event
0 2019-01-11           32          6   RAIN
4 2019-01-15           32          4   RAIN
5 2019-01-16           32          2  SUNNY

In [21]:
df[df.temperature == df.temperature.max()]

         DAY  temperature  windspeed  event
0 2019-01-11           32          6   RAIN
4 2019-01-15           32          4   RAIN
5 2019-01-16           32          2  SUNNY

In [22]:
df[['DAY','temperature']][df.temperature == df['temperature'].min()]

         DAY  temperature
1 2019-01-12           24
3 2019-01-14           24

In [23]:
#WHAT is temperature when wind speed is low ?

df[['temperature','event']][df.windspeed == df['windspeed'].min()]

   temperature  event
2           28   SNOW
5           32  SUNNY

In [24]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [25]:
df

         DAY  temperature  windspeed  event
0 2019-01-11           32          6   RAIN
1 2019-01-12           24          7  SUNNY
2 2019-01-13           28          2   SNOW
3 2019-01-14           24          7   SNOW
4 2019-01-15           32          4   RAIN
5 2019-01-16           32          2  SUNNY

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
df.set_index('DAY')           #remove index

            temperature  windspeed  event
DAY
2019-01-11           32          6   RAIN
2019-01-12           24          7  SUNNY
2019-01-13           28          2   SNOW
2019-01-14           24          7   SNOW
2019-01-15           32          4   RAIN
2019-01-16           32          2  SUNNY

In [28]:
df

         DAY  temperature  windspeed  event
0 2019-01-11           32          6   RAIN
1 2019-01-12           24          7  SUNNY
2 2019-01-13           28          2   SNOW
3 2019-01-14           24          7   SNOW
4 2019-01-15           32          4   RAIN
5 2019-01-16           32          2  SUNNY

In [29]:
df.iloc[0:2,1:3]

   temperature  windspeed
0           32          6
1           24          7

## export excel with defined row and column position, download to see result

## 2.2.1 data frames advance

In [31]:
def convert_event_cell(cell):
    if cell=="SUNNY":
        return 'HOT'
    return cell


dfl =pd.read_excel (r'TEMPERATURE.xls', converters = {
 'event': convert_event_cell  
})


dfl

         DAY  temperature  windspeed event
0 2019-01-11           32          6  RAIN
1 2019-01-12           24          7   HOT
2 2019-01-13           28          2  SNOW
3 2019-01-14           24          7  SNOW
4 2019-01-15           32          4  RAIN
5 2019-01-16           32          2   HOT

In [32]:
dfl.to_excel("newtemp.xlsx", startrow=1, startcol=2, index =False)

In [33]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature':[32,35,28],
    'event':['rain','sunny','snow']
}
dfr =pd.DataFrame(weather_data)
dfr

        day  temperature  event
0  1/1/2017           32   rain
1  1/2/2017           35  sunny
2  1/3/2017           28   snow

In [34]:
weather_datas = [
    ('1/1/2017','32','6','Rain'),
    ('1/2/2017','35','7','Sunny'),
    ('1/3/2017','28','2','Snow'),
]
dfs = pd.DataFrame(weather_datas, columns = ["day","temperature","windspeed","event"])
dfs

        day temperature windspeed  event
0  1/1/2017          32         6   Rain
1  1/2/2017          35         7  Sunny
2  1/3/2017          28         2   Snow

# 2.2.4 concate data frame

In [35]:
usa_weather = pd.DataFrame ({
    "city" : ["New York", "Columbia", "Chicago"],
    "temperature" : [21,32,25],
    "humidity": [65,58,62]
})

usa_weather

       city  temperature  humidity
0  New York           21        65
1  Columbia           32        58
2   Chicago           25        62

In [36]:
india_weather = pd.DataFrame ({
    "city" : ["Nashik", "Mumbai", "Pune"],
    "temperature" : [32,28,30],
    "humidity": [55,48,32]
})
india_weather

     city  temperature  humidity
0  Nashik           32        55
1  Mumbai           28        48
2    Pune           30        32

In [37]:
new_df = pd.concat([india_weather,usa_weather])
new_df

       city  temperature  humidity
0    Nashik           32        55
1    Mumbai           28        48
2      Pune           30        32
0  New York           21        65
1  Columbia           32        58
2   Chicago           25        62

In [38]:
new_df = pd.concat([india_weather,usa_weather], ignore_index =True)
new_df

       city  temperature  humidity
0    Nashik           32        55
1    Mumbai           28        48
2      Pune           30        32
3  New York           21        65
4  Columbia           32        58
5   Chicago           25        62

In [39]:
new_df = pd.concat([india_weather,usa_weather], keys = ["india","usa"] )
new_df

             city  temperature  humidity
india 0    Nashik           32        55
      1    Mumbai           28        48
      2      Pune           30        32
usa   0  New York           21        65
      1  Columbia           32        58
      2   Chicago           25        62

In [40]:
temperature_df = pd.DataFrame ({
    "city" : ["Nashik", "Mumbai", "Pune"],
    "temperature" : [21,32,25]
})

temperature_df

     city  temperature
0  Nashik           21
1  Mumbai           32
2    Pune           25

In [41]:
humidity_df = pd.DataFrame ({
    "city" : ["Pune","Nashik", "Mumbai"],
    "humidity": [55,48,32]
})
humidity_df

     city  humidity
0    Pune        55
1  Nashik        48
2  Mumbai        32

In [65]:
new_df = pd.concat([temperature_df,humidity_df], keys = ["india","usa"],sort=False )
new_df

           city  temperature  humidity
india 0  Nashik         21.0       NaN
      1  Mumbai         32.0       NaN
      2    Pune         25.0       NaN
usa   0    Pune          NaN      55.0
      1  Nashik          NaN      48.0
      2  Mumbai          NaN      32.0

##C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [43]:
new_dfx = pd.concat([temperature_df,humidity_df], axis =1, sort=False )
new_dfx

     city  temperature    city  humidity
0  Nashik           21    Pune        55
1  Mumbai           32  Nashik        48
2    Pune           25  Mumbai        32

In [44]:
dfj = pd.Series(["humid", "dry", "rain"], name = "event")
dfj

0    humid
1      dry
2     rain
Name: event, dtype: object

# 2.3 merge dataframe

In [45]:
df_merge = pd.merge(temperature_df,humidity_df, on = "city")
df_merge

     city  temperature  humidity
0  Nashik           21        48
1  Mumbai           32        32
2    Pune           25        55

In [46]:
df_merge = pd.merge(temperature_df,humidity_df, on = "city", indicator =True)
df_merge

     city  temperature  humidity _merge
0  Nashik           21        48   both
1  Mumbai           32        32   both
2    Pune           25        55   both

In [47]:
usa = pd.DataFrame ({
    "city" : ["Chicago", "Nashik", "Pune", "Mumbai"],
    "temperature" : [29, 21,32,25],
    "humidity": [65,58,62,56]
})

usa

      city  temperature  humidity
0  Chicago           29        65
1   Nashik           21        58
2     Pune           32        62
3   Mumbai           25        56

In [48]:
india = pd.DataFrame ({
    "city" : ["Nashik", "Mumbai", "Pune", "Chicago"],
    "temperature" : [32,28,30,21],
    "humidity": [55,48,32,45]
})
india

      city  temperature  humidity
0   Nashik           32        55
1   Mumbai           28        48
2     Pune           30        32
3  Chicago           21        45

In [49]:
df9 =pd.merge(usa,india, on="city")
df9

      city  temperature_x  humidity_x  temperature_y  humidity_y
0  Chicago             29          65             21          45
1   Nashik             21          58             32          55
2     Pune             32          62             30          32
3   Mumbai             25          56             28          48

In [50]:
df9 =pd.merge(usa,india, on="city", suffixes=('left','right'))
df9

      city  temperatureleft  humidityleft  temperatureright  humidityright
0  Chicago               29            65                21             45
1   Nashik               21            58                32             55
2     Pune               32            62                30             32
3   Mumbai               25            56                28             48

# below are under construction & exercises

In [51]:
new_df['tempwind']= np.where(new_df['temperature']> 27,'low', 0 )
new_df['tempwind']

india  0      0
       1    low
       2      0
usa    0      0
       1      0
       2      0
Name: tempwind, dtype: object

In [52]:
new_df['tempwind']= np.square(new_df['temperature'] - new_df['humidity'])
new_df['tempwind']

india  0   NaN
       1   NaN
       2   NaN
usa    0   NaN
       1   NaN
       2   NaN
Name: tempwind, dtype: float64

In [53]:
matrixx = [
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12]
]

dfc = pd.DataFrame(matrixx)

In [54]:
dfc

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [55]:
dfg= pd.DataFrame([[12,2,3,47],[5,36,7,48],[9,10,41,12]], columns = ["d","t","w","e"],)

In [56]:
dfg

    d   t   w   e
0  12   2   3  47
1   5  36   7  48
2   9  10  41  12

In [57]:
dfw = pd.DataFrame([[1,2,3,4],
                    [5,6,7,8],
                    [9,10,11,12],
                    [56,63,75,8],
                   [87,54,9,24]], columns = ["day","temperature","windspeed","event"])

In [58]:
dfw

   day  temperature  windspeed  event
0    1            2          3      4
1    5            6          7      8
2    9           10         11     12
3   56           63         75      8
4   87           54          9     24

In [59]:
dfw.min()

day            1
temperature    2
windspeed      3
event          4
dtype: int64

In [60]:
dfw.mean()

day            31.6
temperature    27.0
windspeed      21.0
event          11.2
dtype: float64

In [61]:
dfw.iloc[0:2,1:3]

   temperature  windspeed
0            2          3
1            6          7

In [62]:
matrixx = [
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12]
]

dfc = pd.DataFrame(matrixx)

dfc


dfg= pd.DataFrame([[12,2,3,47],[5,36,7,48],[9,10,41,12]], columns = ["d","t","w","e"],)

dfg

dfw = pd.DataFrame([[1,2,3,4],
                    [5,6,7,8],
                    [9,10,11,12],
                    [56,63,75,8],
                   [87,54,9,24]], columns = ["day","temperature","windspeed","event"])

dfw

dfw.min()

dfw.mean()

dfw.iloc[0:2,1:3]

   temperature  windspeed
0            2          3
1            6          7